experiments/mtp-sweep-2026-09-11/sweep8/bench_R2cZ8_c108t_p1.log
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7fb68076bce0>, trust_remote_code=False, seed=0, num_prompts=108, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=256, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai-chat', base_url=None, host='127.0.0.1', port=8341, endpoint='/v1/chat/completions', header=None, max_concurrency=54, model='qwen38-27b', input_len=None, output_len=None, tokenizer='<model-dir>', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, probe_request_rate=0.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=False, self_timed=None, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-4ce7d940-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 09-12 05:03:19 [utils.py:90] Sampling input_len from [1024, 1024] and output_len from [256, 256]
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 54
100%|██████████| 108/108 [01:25<00:00,  1.27it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     108       
Failed requests:                         0         
Maximum request concurrency:             54        
Benchmark duration (s):                  85.29     
Total input tokens:                      116250    
Total generated tokens:                  27648     
Request throughput (req/s):              1.27      
Output token throughput (tok/s):         324.16    
Peak output token throughput (tok/s):    350.00    
Peak concurrent requests:                58.00     
Total token throughput (tok/s):          1687.13   
---------------Time to First Token----------------
Mean TTFT (ms):                          19504.27  
Median TTFT (ms):                        21107.65  
P99 TTFT (ms):                           37685.28  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          63.92     
Median TPOT (ms):                        63.53     
P99 TPOT (ms):                           91.75     
---------------Inter-token Latency----------------
Mean ITL (ms):                           115.21    
Median ITL (ms):                         74.36     
P99 ITL (ms):                            663.96    
---------------Speculative Decoding---------------
Acceptance rate (%):                     81.84     
Acceptance length:                       1.82      
Drafts:                                  15173     
Draft tokens:                            15173     
Accepted tokens:                         12418     
Per-position acceptance (%):
  Position 0:                            81.84     
==================================================